ITHACA-FV/tutorials/CFD/07NonIsothermalMixingElbow/0/Ulift0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
2200
(
(1.00006 1.55515e-05 0)
(1.00006 5.01173e-05 0)
(1.00006 9.16726e-05 0)
(1.00006 0.000140626 0)
(1.00006 0.000197451 0)
(1.00005 0.000261927 0)
(1.00005 0.000332388 0)
(1.00004 0.000404488 0)
...
)
;

boundaryField
{
    wall-4
    {
        type            noSlip;
    }
    pressure-outlet-7
    {
        type            zeroGradient;
    }
    velocity-inlet-6
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    velocity-inlet-5
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
